/*----------------------------------------------------------------------------------------------------
                                    ЗАДАНИЕ
Написать реализацию функции invertCase(), которая инвертирует регистр каждого символа в переданной строке.
----------------------------------------------------------------------------------------------------*/


function invertCase($str)
{
    for ($i=0; $i<=strlen($str); $i++) {
        if (preg_match("/^[A-Z]/", $str[$i])) {
// preg_match - Проверяет  букву в верхнем регистре строки $str и возвращает 1 или 0
            print_r(mb_strtolower($str[$i])); // буквы приводятся к нижнему регистру.

        } else {
            print_r(mb_strtoupper($str[$i]));  //Приведение символа к верхнему регистру
        }

    }

}
                                
                                
print_r(invertCase('AbDz!'));
