/*----------------------------------------------------------------------------------------------------
                                    ЗАДАНИЕ
Реализуйте функцию joinNumbersFromRange(), которая объединяет все числа из диапазона в строку:
----------------------------------------------------------------------------------------------------*/



function joinNumbersFromRange($min, $max)
{
    $result ='';
    while ($min<=$max) {
        $result= "{$result}{$min}";
        $min++;

    }

    return $result;
}

print_r(joinNumbersFromRange(5,15));

                      
