/*----------------------------------------------------------------------------------------------------
                                    ЗАДАНИЕ
Реализуйте функцию sumOfSeries(), которая считает сумму ряда целых чисел.
Ряд задаётся двумя числами — начальным и конечным.
Функция принимает два аргумента-числа и возвращает сумму ряда.
----------------------------------------------------------------------------------------------------*/


function sumOfSeries($first_num, $last_num)
{
    $result = 0;
    for ($first_num; $first_num<=$last_num; $first_num++) {
        $result = $result+$first_num;
    }
    return $result;
}


                                           
print_r(sumOfSeries(3,3));
